{"pageProps":{"postData":{"id":"localuser_on_windows_11","contentHtml":"<h1>How to Enable a Local User Account When Installing Windows 11 as a Virtual Machine</h1>\n<p>If you're looking to create a local user account on Windows 11 during a virtual machine (VM) installation, you’ll be pleased to know there are straightforward methods to achieve this. Here, we’ll explore two different techniques you can use to enable a local user account without the need for online credentials or internet connectivity.</p>\n<h2>Method 1: Adding a Local User with Command Prompt</h2>\n<p>This approach requires a few steps during the installation process by utilizing the Command Prompt. Here’s how to do it:</p>\n<ol>\n<li>\n<p>During the installation process, once you reach the login stages, press <strong>Shift + F10</strong>. This will open the Command Prompt.</p>\n</li>\n<li>\n<p>Enter the following commands sequentially:</p>\n<div class=\"hl hl-shell\"><div class=\"hl-header\"><div class=\"hl-language\"><span>shell</span></div></div><pre id=\"MC41NzQ1OTYy\" style=\"--hl-line-number-gutter-factor: 1\"><code tabindex=\"0\"><span class=\"line\"><span class=\"line-number\" aria-hidden=\"true\">1</span>net user Admin /add</span>\n<span class=\"line\"><span class=\"line-number\" aria-hidden=\"true\">2</span>net localgroup Administrators Admin /add</span>\n<span class=\"line\"><span class=\"line-number\" aria-hidden=\"true\">3</span><span class=\"pl-c1\">cd</span> OOBE</span>\n<span class=\"line\"><span class=\"line-number\" aria-hidden=\"true\">4</span>msoobe.exe <span class=\"pl-k\">&#x26;&#x26;</span> shutdown -r</span>\n</code></pre></div>\n</li>\n<li>\n<p>After the system restarts, you’ll simply need to click “Okay” to finalize the process.</p>\n</li>\n</ol>\n<p>This method effectively creates an admin-level local user account without the hassle of online logins during setup.</p>\n<h2>Method 2: Offline Installation to Bypass Network Requirements</h2>\n<p>If you prefer to keep your VM installation entirely offline until the system is fully set up, this method is for you. Here's the step-by-step process:</p>\n<ol>\n<li>\n<p>Disconnect your VM from any network connections before starting the installation.</p>\n</li>\n<li>\n<p>When prompted for a network connection, run the following command to bypass the requirement:</p>\n<div class=\"hl hl-shell\"><div class=\"hl-header\"><div class=\"hl-language\"><span>shell</span></div></div><pre id=\"MC4zMTk4Njg0\"><code tabindex=\"0\"><span class=\"line\">oobe<span class=\"pl-cce\">\\b</span>ypassnro</span>\n</code></pre></div>\n</li>\n<li>\n<p>You will then have the option to click \"I don't have internet.\"</p>\n</li>\n<li>\n<p>Proceed with creating a local user account as prompted by the installation wizard.</p>\n</li>\n</ol>\n<p>Both of these methods offer an effective way to set up a Windows 11 VM with a local user account, enabling you to bypass the mandatory network and Microsoft account requirements that typically come with standard installations.</p>\n<p>For those who prefer visual guidance, there are excellent tutorials available on YouTube by <a href=\"https://youtu.be/Q3TnVAPPqac\">Britec</a> and <a href=\"https://youtu.be/Mn9bhG4nWel\">CyberCPU Tech</a>, showcasing these processes in detail. Whether you’re setting up a test environment or a dedicated offline system, these tips ensure you can customize your Windows 11 installation to best suit your needs.</p>","title":"Localuser on windows 11","date":"2025-01-15","tags":"windows 11, localuser, privacy"}},"__N_SSG":true}